#จุฑามาศ  สงึมรัมย์

#ตัวดำเนินการเปรียบเทียบ

#== เท่ากับ
#!= ไม่เท่ากับ
#> มากกว่า
#< น้อยกว่า
#>= มากกว่าหรือเท่ากับ
#<= น้อยกว่าหรือเท่ากับ

#การเปรียบเทียบผลลัพท์จะมี 2 คือ จริง/เท็จ
#boolean (ชนิดของข้อมูลบูลีน)
#T true เป็นจริง
#F false เป็นเท็จ

#---------------------------------------------------

print("โปรแกรมเปรียบเทียบค่า 2 ค่า")
print("ใส่ค่าที่ 1 :")
x = input()
x = int(x)
print("ใส่ค่าที่ 2 :")
y = input()
y = int(y)

print("x=y  " , x==y)
print("x!=y " , x!=y)
print("x>y  " , x>y)
print("x<y  " , x<y)
print("x>=y " , x>=y)
print("x<=y " , x<=y)

#---------------------------------------------------

print("โปรแกรมเปรียบเทียบค่า 2 ค่า")
print("ใส่ค่า x :")
x = input()
x = int(x)
print("ใส่ค่า y :")
y = input()
y = int(y)

if x==y:
    print("x มีค่าเท่ากับ y")
elif x>y:
    print("x มีค่ามากกว่า y")
else:
    print("x มีค่าน้อยกว่า y")

print("สิ้นสุดโปรแกรม")


#----------------------------------------------------

#ชื่อ-สกุล ชั้น เลขประจำตัว
print("โปรแกรมแสดงผลสอบผ่าน/ไม่ผ่าน")
print("กรุณากรอกคะแนน(100) :")
x = input()
x = int(x)

if x > 50 and x <= 100 :
    print("คุณสอบผ่าน")
elif x < 50 and x >= 0 :
    print("คุณสอบไม่ผ่าน")
else:
    print("กรุณากรอกคะแนนใหม่")

print("สิ้นสุดโปรแกรม")

#----------------------------------------------------