"""
ชื่อ - สกุล
สธด 2/1-2 รหัส 000
"""
#ตัวดำเนินการทางคณิตศาสตร์
# +  บวก
# -  ลบ
# *  คูณ
# /  หาร
# // หารเอาเลขตัวหน้า
# %  หารเอาเศษ
# ** ยกกำลัง

#ชนิดของตัวแปร
#int จำนวนเต็ม
#float จำนวนทศนิยม
#char ตัวอักษร
#string ข้อความ

print("ใส่ค่า x :")
x = input() #ชนิดข้อมูลของ x เป็น char
x = int(x)  #แปลงข้อมูลจาก char เป็น int
print("ใส่ค่า y :")
y = input()
y = int(y)

print("x+y=", x+y)   #บวก
print(type(x+y))     #ดูชนิดของข้อมูลของ x+y
print("x-y=", x-y)   #ลบ
print(type(x-y))     #ดูชนิดของข้อมูลของ x-y
print("x*y=", x*y)   #คูณ
print(type(x*y))     #ดูชนิดของข้อมูลของ x*y
print("x/y=", x/y)   #หาร
print(type(x/y))     #ดูชนิดของข้อมูลของ x/y
print("x//y=", x//y) #หารเอาเลขตัวหน้า
print(type(x//y))    #ดูชนิดของข้อมูลของ x//y
print("x%y=", x%y)   #หารเอาเศษ
print(type(x%y))     #ดูชนิดของข้อมูลของ x%y
print("x**y=", x**y) #ยกกำลัง
print(type(x**y))    #ดูชนิดของข้อมูลของ x**y

#-------------------------------------------

#โปรแกรมหาพื้นที่สี่เหลี่ยมผืนผ้า

print("โปรแกรมคำนวณพื้นที่สี่เหลี่ยมผืนผ้า")
print("ใส่ขนาดด้านกว้าง")
w = input()
w = int(w)
print("ใส่ขนาดด้านยาว")
h = input()
h = int(h)

print("พื้นที่ของสี่เหลี่ยมผืนผ้าคือ", w*h )

#--------------------------------------------


#ชื่อ - สกุล
#สธด 2/1-2 รหัส 000

#โปรแกรมหาพื้นที่สี่เหลี่ยมคางหมู

print("โปรแกรมคำนวณพื้นที่สี่เหลี่ยมคางหมู")
print("ใส่ขนาดด้านยาว")
a = input()
a = int(a)
print("ใส่ขนาดด้านสั้น")
b = input()
b = int(b)
print("ใส่ขนาดด้านสูง")
h = input()
h = int(h)
print("พื้นที่ของสี่เหลี่ยมคางหมูคือ",1/2*h*(a+b))